In [45]:
#import libraries
import numpy as np
import pandas as pd

In [46]:
#load data
df_main =pd.read_csv("train_data.csv")

In [47]:
df_main.head()

,Investor_ID,Age,Annual_Income,Investment_Amount,Risk_Tolerance_Score,Months_of_Investing_Experience,Number_of_Active_Investments,Potential_Return_Rate,Investment_Duration,Investment_to_Income_Ratio,Education,Employment_Status,Marital_Status,Owns_Property,Has_Dependents,Investment_Sector,Has_Investment_Advisor,Investment_Failed
0,0003HW9UAA,51.0,NaN,87300.0,358,13,3.0,18.10,12,0.85,Bachelor's,Part-time,NaN,No,NO,Other,True,0
1,000ELHLBPV,37.0,81658.0,152598.0,792,23,4.0,14.06,24,0.86,PhD,Self-employed,NaN,Yes,No,Auto,False,1
2,000G6CHJON,NaN,NaN,77767.0,359,57,4.0,4.31,60,0.60,Master's,Unemployed,Married,No,No,Education,True,0
3,000K09D0JB,54.0,42344.0,13261.0,366,115,1.0,NaN,60,0.21,PhD,Part-time,Divorced,No,No,Education,True,0
4,000NTH4YTU,63.0,48898.0,193990.0,792,53,4.0,5.65,48,0.82,Master's,Self-employed,Married,Yes,No,Business,True,0

In [48]:
df_main.shape

(225347, 18)

In [49]:
df_main.isnull().sum()

Investor_ID                           0
Age                               32840
Annual_Income                     22626
Investment_Amount                 18033
Risk_Tolerance_Score                  0
Months_of_Investing_Experience        0
Number_of_Active_Investments       4512
Potential_Return_Rate             11244
Investment_Duration                   0
Investment_to_Income_Ratio            0
Education                             0
Employment_Status                     0
Marital_Status                    42906
Owns_Property                         0
Has_Dependents                        0
Investment_Sector                     0
Has_Investment_Advisor             3849
Investment_Failed                     0
dtype: int64

In [50]:
#summary for data
df_main.describe()

,Age,Annual_Income,Investment_Amount,Risk_Tolerance_Score,Months_of_Investing_Experience,Number_of_Active_Investments,Potential_Return_Rate,Investment_Duration,Investment_to_Income_Ratio,Investment_Failed
count,192507.000000,202721.000000,207314.000000,225347.000000,225347.000000,220835.000000,214103.000000,225347.000000,225347.000000,225347.000000
mean,46.026004,82793.709196,126997.235204,598.569708,59.832942,2.498413,13.417184,36.028756,0.499736,0.087212
std,19.066572,38856.728908,70766.875540,186.348988,34.617474,1.116728,6.628983,16.968128,0.230821,0.282146
min,18.000000,15000.000000,5000.000000,300.000000,0.000000,1.000000,2.000000,12.000000,0.100000,0.000000
25%,31.000000,49293.000000,65589.250000,445.000000,30.000000,2.000000,7.700000,24.000000,0.300000,0.000000
50%,45.000000,82908.000000,126790.500000,589.000000,60.000000,2.000000,13.350000,36.000000,0.500000,0.000000
75%,58.000000,116369.000000,188104.500000,735.000000,90.000000,3.000000,19.160000,48.000000,0.700000,0.000000
max,119.000000,149999.000000,249999.000000,1099.000000,119.000000,4.000000,25.000000,60.000000,0.900000,1.000000

In [51]:
#label encoder for education column
from sklearn.preprocessing import LabelEncoder
labelencoder = LabelEncoder()
df_main['Education'] = labelencoder.fit_transform(df_main['Education'])

In [52]:
#read column Education
df_main['Education'].value_counts()

Education
0    56748
3    56258
2    56224
1    56117
Name: count, dtype: int64

In [53]:
df_main.head()

,Investor_ID,Age,Annual_Income,Investment_Amount,Risk_Tolerance_Score,Months_of_Investing_Experience,Number_of_Active_Investments,Potential_Return_Rate,Investment_Duration,Investment_to_Income_Ratio,Education,Employment_Status,Marital_Status,Owns_Property,Has_Dependents,Investment_Sector,Has_Investment_Advisor,Investment_Failed
0,0003HW9UAA,51.0,NaN,87300.0,358,13,3.0,18.10,12,0.85,0,Part-time,NaN,No,NO,Other,True,0
1,000ELHLBPV,37.0,81658.0,152598.0,792,23,4.0,14.06,24,0.86,3,Self-employed,NaN,Yes,No,Auto,False,1
2,000G6CHJON,NaN,NaN,77767.0,359,57,4.0,4.31,60,0.60,2,Unemployed,Married,No,No,Education,True,0
3,000K09D0JB,54.0,42344.0,13261.0,366,115,1.0,NaN,60,0.21,3,Part-time,Divorced,No,No,Education,True,0
4,000NTH4YTU,63.0,48898.0,193990.0,792,53,4.0,5.65,48,0.82,2,Self-employed,Married,Yes,No,Business,True,0

In [54]:
#read marital status column
df_main['Marital_Status'].value_counts()

Marital_Status
Divorced    39174
Married     38979
Single      38886
Sgl         21918
Marr        21834
Div         21650
Name: count, dtype: int64

In [55]:
#replace sgl with single, Marr with married, Div with Divorced
df_main['Marital_Status'] = df_main['Marital_Status'].replace('Sgl', 'Single')
df_main['Marital_Status'] = df_main['Marital_Status'].replace('Marr', 'Married')
df_main['Marital_Status'] = df_main['Marital_Status'].replace('Div', 'Divorced')

In [56]:
df_main['Marital_Status'].value_counts()

Marital_Status
Divorced    60824
Married     60813
Single      60804
Name: count, dtype: int64

In [57]:
df_main['Marital_Status'].isnull().sum()

42906

In [58]:
df_main.head()

,Investor_ID,Age,Annual_Income,Investment_Amount,Risk_Tolerance_Score,Months_of_Investing_Experience,Number_of_Active_Investments,Potential_Return_Rate,Investment_Duration,Investment_to_Income_Ratio,Education,Employment_Status,Marital_Status,Owns_Property,Has_Dependents,Investment_Sector,Has_Investment_Advisor,Investment_Failed
0,0003HW9UAA,51.0,NaN,87300.0,358,13,3.0,18.10,12,0.85,0,Part-time,NaN,No,NO,Other,True,0
1,000ELHLBPV,37.0,81658.0,152598.0,792,23,4.0,14.06,24,0.86,3,Self-employed,NaN,Yes,No,Auto,False,1
2,000G6CHJON,NaN,NaN,77767.0,359,57,4.0,4.31,60,0.60,2,Unemployed,Married,No,No,Education,True,0
3,000K09D0JB,54.0,42344.0,13261.0,366,115,1.0,NaN,60,0.21,3,Part-time,Divorced,No,No,Education,True,0
4,000NTH4YTU,63.0,48898.0,193990.0,792,53,4.0,5.65,48,0.82,2,Self-employed,Married,Yes,No,Business,True,0

In [59]:
df_main.tail(10)

,Investor_ID,Age,Annual_Income,Investment_Amount,Risk_Tolerance_Score,Months_of_Investing_Experience,Number_of_Active_Investments,Potential_Return_Rate,Investment_Duration,Investment_to_Income_Ratio,Education,Employment_Status,Marital_Status,Owns_Property,Has_Dependents,Investment_Sector,Has_Investment_Advisor,Investment_Failed
225337,ZZYV5HLQSK,54.0,112684.0,249337.0,711,47,3.0,7.27,12,0.26,1,Part-time,NaN,no,Ye,Other,False,0
225338,ZZYY9OOQS8,31.0,73730.0,33483.0,744,87,2.0,3.04,60,0.41,3,Part-time,Divorced,Yes,No,Education,False,0
225339,ZZZA9AN4OC,37.0,135712.0,37731.0,553,25,3.0,11.62,60,0.45,0,Self-employed,NaN,Yes,no,Education,True,0
225340,ZZZDBG1MW7,60.0,29679.0,13057.0,455,81,1.0,13.83,36,0.23,1,Self,Single,Yes,No,Education,True,0
225341,ZZZDJ23OK9,30.0,118720.0,93079.0,619,51,1.0,5.41,60,0.65,1,Unemployed,Married,NO,YE,Other,True,0
225342,ZZZHT6VWO4,37.0,25394.0,NaN,527,12,2.0,NaN,24,0.17,0,Unemployed,Married,Ye,Maybe,Education,False,1
225343,ZZZI5YOV9G,32.0,101616.0,101862.0,628,32,2.0,17.45,12,0.38,1,Full-time,Single,Yes,no,Education,False,1
225344,ZZZMFPZFKE,NaN,102495.0,140375.0,764,82,4.0,23.82,24,0.63,1,Full-time,Divorced,yes,No,Other,False,0
225345,ZZZV1HB132,69.0,143661.0,157929.0,407,38,4.0,6.07,60,0.33,2,Part-time,Divorced,Yes,Yes,Home,False,0
225346,ZZZX015LV2,65.0,114515.0,95500.0,820,45,4.0,8.87,48,0.13,1,Full-time,Single,no,No,Business,False,0

In [61]:
#read has dependents column
df_main['Has_Dependents'].value_counts()

Has_Dependents
No         88990
Yes        71791
Ye         17469
no         10998
NO         10864
yes         8815
YES         8668
ye          2175
YE          2121
Maybe       1829
Unknown     1627
Name: count, dtype: int64

In [62]:
#replace Ye with Yes, yes with Yes, YES with Yes, ye with Yes, YE with Yes
df_main['Has_Dependents'] = df_main['Has_Dependents'].replace('Ye', 'Yes')
df_main['Has_Dependents'] = df_main['Has_Dependents'].replace('yes', 'Yes')
df_main['Has_Dependents'] = df_main['Has_Dependents'].replace('YES', 'Yes')
df_main['Has_Dependents'] = df_main['Has_Dependents'].replace('ye', 'Yes')
df_main['Has_Dependents'] = df_main['Has_Dependents'].replace('YE', 'Yes')

In [63]:
#replace no with No, NO with No  
df_main['Has_Dependents'] = df_main['Has_Dependents'].replace('no', 'No')
df_main['Has_Dependents'] = df_main['Has_Dependents'].replace('NO', 'No')

In [64]:
df_main['Has_Dependents'].value_counts()

Has_Dependents
Yes        111039
No         110852
Maybe        1829
Unknown      1627
Name: count, dtype: int64

In [65]:
df_main['Employment_Status'].value_counts()

Employment_Status
Part-time        52525
Full-time        52378
Self-employed    52231
Unemployed       51838
Self              3912
Part              3872
Full              3860
Unem              3822
Retired            909
Name: count, dtype: int64

In [69]:
df_main['Employment_Status'] = df_main['Employment_Status'].replace('Self-employed', 'Self')
df_main['Employment_Status'] = df_main['Employment_Status'].replace('Part', 'Part-time')
df_main['Employment_Status'] = df_main['Employment_Status'].replace('Full', 'Full-time')
df_main['Employment_Status'] = df_main['Employment_Status'].replace('Unem', 'Unemployed')

In [70]:
df_main['Employment_Status'].value_counts()

Employment_Status
Part-time     56397
Full-time     56238
Self          56143
Unemployed    55660
Retired         909
Name: count, dtype: int64